NextFOAM-2404/tutorials/multiphase/icoReactingMultiphaseInterFoam/evaporationMultiComponent/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bottom
    {
        type        fixedValue;
        value       $internalField;
    }

    top
    {
        type        pressureInletOutletVelocity;
        value       uniform (0 0 0);
    }

    left
    {
        type        fixedValue;
        value       $internalField;
    }

    right
    {
        type        fixedValue;
        value       $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
